## 作业
## 3. 案例分析：美国各州人口数据分析

In [109]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

作业知识补充

In [110]:
# unique() 去重函数
s = Series(['Tom','Lucy','Tom','dancer','Lucy'])

In [111]:
s.unique()

array(['Tom', 'Lucy', 'dancer'], dtype=object)

In [112]:
n = DataFrame({'name':['Tom','Lucy','Tom','dancer','Lucy'],'age':[12,13,12,11,15]})
n

   age    name
0   12     Tom
1   13    Lucy
2   12     Tom
3   11  dancer
4   15    Lucy

In [113]:
# query 条件查询函数
n.query("name == 'Lucy' & age>14")

   age  name
4   15  Lucy

首先导入文件，并查看数据样本

In [114]:
s_abb = pd.read_csv('../data/state-abbrevs.csv')
s_abb.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [115]:
s_pop = pd.read_csv('../data/state-population.csv')
s_pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [116]:
s_ares = pd.read_csv('../data/state-areas.csv')
s_ares.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

合并pop与abbrevs两个DataFrame，分别依据state/region列和abbreviation列来合并。

为了保留所有信息，使用外合并。

In [118]:
s1 = s_pop.merge(s_abb,left_on='state/region',right_on='abbreviation',how='outer')
s1.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

去除abbreviation的那一列（axis=1）

In [119]:
s1.drop('abbreviation',axis = 1,inplace=True)
s1.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

查看存在缺失数据的列。

使用.isnull().any()，只有某一列存在一个缺失数据，就会显示True。

In [120]:
s1.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

查看缺失数据

In [143]:
s1.loc[s1.isnull().any(axis=1)].head()

     state/region     ages  year  population        state
2448           PR  under18  1990         NaN  Puerto Rico
2449           PR    total  1990         NaN  Puerto Rico
2450           PR    total  1991         NaN  Puerto Rico
2451           PR  under18  1991         NaN  Puerto Rico
2452           PR    total  1993         NaN  Puerto Rico

根据数据是否缺失情况显示数据，如果缺失为True，那么显示

In [122]:
# ??

找到有哪些state/region使得state的值为NaN，使用unique()查看非重复值

In [123]:
b_nan = s1['state'].isnull()
s1.loc[b_nan]['state/region'].unique()

array(['PR', 'USA'], dtype=object)

为找到的这些state/region的state项补上正确的值，从而去除掉state这一列的所有NaN！

记住这样清除缺失数据NaN的方法！

In [147]:
b = s1['state/region'] == 'PR'
s1['state'][b]='Puerto Rico'
s1.loc[s1.isnull().any(axis=1)].head()

D:\conda\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

     state/region     ages  year  population        state
2448           PR  under18  1990         NaN  Puerto Rico
2449           PR    total  1990         NaN  Puerto Rico
2450           PR    total  1991         NaN  Puerto Rico
2451           PR  under18  1991         NaN  Puerto Rico
2452           PR    total  1993         NaN  Puerto Rico

In [145]:
b = s1['state/region'] == 'USA'
s1['state'][b]='United States of America'
s1.loc[s1.isnull().any(axis=1)].head()

D:\conda\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

     state/region     ages  year  population        state
2448           PR  under18  1990         NaN  Puerto Rico
2449           PR    total  1990         NaN  Puerto Rico
2450           PR    total  1991         NaN  Puerto Rico
2451           PR  under18  1991         NaN  Puerto Rico
2452           PR    total  1993         NaN  Puerto Rico

合并各州面积数据areas，使用左合并。

思考一下为什么使用外合并？

In [126]:
s2=s1.merge(s_ares,how='outer')
s2.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

继续寻找存在缺失数据的列

In [127]:
s2.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

我们会发现area(sq.mi)这一列有缺失数据，为了找出是哪一行，我们需要找出是哪个state没有数据

In [128]:
s2[s2['population'].isnull()].head()

     state/region     ages  year  population        state  area (sq. mi)
2448           PR  under18  1990         NaN  Puerto Rico         3515.0
2449           PR    total  1990         NaN  Puerto Rico         3515.0
2450           PR    total  1991         NaN  Puerto Rico         3515.0
2451           PR  under18  1991         NaN  Puerto Rico         3515.0
2452           PR    total  1993         NaN  Puerto Rico         3515.0

In [142]:
d = s2['area (sq. mi)'].isnull()
s2[d].head()

,state/region,ages,year,population,state,area (sq. mi)
2496,USA,under18,1990,64218512.0,United States of America,NaN
2497,USA,total,1990,249622814.0,United States of America,NaN
2498,USA,total,1991,252980942.0,United States of America,NaN
2499,USA,under18,1991,65313018.0,United States of America,NaN
2500,USA,under18,1992,66509177.0,United States of America,NaN

去除含有缺失数据的行

In [141]:
s3 = s2.dropna()
s3.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

查看数据是否缺失

In [131]:
s3.isnull().any()

state/region     False
ages             False
year             False
population       False
state            False
area (sq. mi)    False
dtype: bool

找出2010年的全民人口数据,df.query(查询语句)

In [132]:
s_query=s3.query("year == 2010 and ages=='total'")
s_query.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

对查询结果进行处理，以state列作为新的行索引:set_index

In [133]:
s_query.set_index('state',inplace=True)

In [134]:
s_query.head()

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0        52423.0
Alaska               AK  total  2010    713868.0       656425.0
Arizona              AZ  total  2010   6408790.0       114006.0
Arkansas             AR  total  2010   2922280.0        53182.0
California           CA  total  2010  37333601.0       163707.0

计算人口密度。注意是Series/Series，其结果还是一个Series。

In [140]:
midu = s_query['population']/s_query['area (sq. mi)']
midu.head()

state
Alabama        91.287603
Alaska          1.087509
Arizona        56.214497
Arkansas       54.948667
California    228.051342
dtype: float64

排序，并找出人口密度最高的五个州sort_values()

In [139]:
 midu.sort_values(inplace=True)
midu.head()

state
Alaska           1.087509
Wyoming          5.768079
Montana          6.736171
North Dakota     9.537565
South Dakota    10.583512
dtype: float64

In [137]:
midu[-5:]

state
Connecticut              645.600649
Rhode Island             681.339159
New Jersey              1009.253268
Puerto Rico             1058.665149
District of Columbia    8898.897059
dtype: float64

找出人口密度最低的五个州

In [138]:
midu[0:5]

state
Alaska           1.087509
Wyoming          5.768079
Montana          6.736171
North Dakota     9.537565
South Dakota    10.583512
dtype: float64

要点总结：
- 统一用loc()索引
- 善于使用.isnull().any()找到存在NaN的列
- 善于使用.unique()确定该列中哪些key是我们需要的
- 一般使用外合并、左合并，目的只有一个：宁愿该列是NaN也不要丢弃其他列的信息

## 回顾：Series/DataFrame运算与ndarray运算的区别

- Series与DataFrame没有广播，如果对应index没有值，则记为NaN；或者使用add的fill_value来补缺失值
- ndarray有广播，通过重复已有值来计算